openFOAM/SampleCase/cavity/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.005;

writeControl    timeStep;

writeInterval   20;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //

functions
{
    caseInfo1
    {
        type            caseInfo;
        libs            (utilityFunctionObjects);
        writeFormat     json; // or dictionary

        // Optional: Specify dictionaries to extract entries from
        dictionaries
        {
            fvSolution
            {
                name    "fvSolution"; // Include all entries
            }
            controlDict
            {
                path    "system/controlDict";
                include ( "application" "deltaT" "startTime" "endTime" );
            }
        }

        // Optional: Extract results from other function objects
/*        functionObjects
        (
            pressureDifference
            sample1
        );*/
    }
}
