openFOAM/SampleCase/cavity/system/dataLogger
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dataLogger;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

api
{
	host "192.168.0.30";
	port "8001";
	username "user@test.com";
	password "test!12345678";
}

broker
{
	host "192.168.0.30";
	port "9092";
	topic "events";
}


// ************************************************************************* //
